CREATE TABLE book (
    id BIGSERIAL PRIMARY KEY,
    title VARCHAR(255) NOT NULL,
    author VARCHAR(255) NOT NULL,
	genre VARCHAR(255) NOT NULL,
    year INTEGER NOT NULL,
	price INTEGER NOT NULL
);

INSERT INTO book (title, author, genre, year, price) VALUES
('Война и мир', 'Лев Толстой', 'Роман', 1867, 0),
('Преступление и наказание', 'Фёдор Достоевский', 'Роман', 1866, 0),
('Анна Каренина', 'Лев Толстой', 'Роман', 1878, 0),
('48 законов власти', 'Роберт Грин', 'Психология', 2014, 549),
('Зов Ктулху', 'Говард Лавкрафт', 'Ужасы', 1928, 376),
('Портрет Дориана Грея', 'Оскар Уайльд', 'Роман', 1890, 313),
('Мастер и Маргарита', 'Михаил Булгаков', 'Роман', 1967, 162),
('Евгений Онегин', 'Александр Пушкин', 'Роман', 1833, 22);